---
kind: type
id: T:Autodesk.Revit.DB.DeleteWorksetOption
source: html/f49f5cf3-7707-f004-acec-e816ad74a08b.htm
---
# Autodesk.Revit.DB.DeleteWorksetOption

This class defines an enumerative type used to specify the option to delete a workset.

## Syntax (C#)
```csharp
public enum DeleteWorksetOption
```